bench/results/2026-09-25-r731b-std-bench-stock/cells/client-B-specbench-c1.log
INFO 09-25 22:30:13 [importing.py:74] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-25 22:30:13 [importing.py:98] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-25 22:30:13 [interface.py:368] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
W0925 22:30:13.395000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
shim: patched vllm 0.30.0: openai-chat -> tabby_chat (usage from any frame, CRLF SSE, min_tokens=output_len ON); SpecBench skip_chat_template forced, SpecBench jsonl read without pandas; sample manifest ON
INFO 09-25 22:30:15 [main.py:80] Unspecified platform detected, switching to CPU Platform instead.
[transformers] Unrecognized keys in `rope_parameters` for 'rope_type'='default': {'mrope_interleaved', 'mrope_section'}
[transformers] Unrecognized keys in `rope_parameters` for 'rope_type'='default': {'mrope_interleaved', 'mrope_section'}
[transformers] Unrecognized keys in `rope_parameters` for 'rope_type'='default': {'mrope_interleaved', 'mrope_section'}
[...]
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7bdc8343c180>, trust_remote_code=False, seed=7310, num_prompts=480, dataset_name='spec_bench', no_stream=False, dataset_path='/data/spec_bench_question.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8022', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='qwen3.8-flash-next-exl3-2.50bpw-r0b0tlab', input_len=None, output_len=None, tokenizer='/model', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['unit=r731b-std-bench-stock', 'tag=B-specbench-c1', 'pass=B', 'dataset=specbench', 'conc=1', 'num_warmups=0', 'unit_warmup=1x non-stream out-of-set', 'boot=fresh per cell', 'thinking=template-default', 'length_forcing=min_tokens', 'client=vllm-v0.30.0+vllm_bench_tabby'], result_dir='/out', result_filename='B-specbench-c1.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-b35c6882-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-25 22:30:15 [datasets.py:311] Skipping oversampling. Total samples: 480.
shim: 480 samples recorded to /out/B-specbench-c1.samples.tsv
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     480       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  503.57    
Total input tokens:                      154537    
Total generated tokens:                  122880    
Request throughput (req/s):              0.95      
Output token throughput (tok/s):         244.02    
Peak output token throughput (tok/s):    101.00    
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          550.91    
---------------Time to First Token----------------
Mean TTFT (ms):                          184.82    
Median TTFT (ms):                        132.86    
P50 TTFT (ms):                           132.86    
P90 TTFT (ms):                           314.75    
P99 TTFT (ms):                           417.17    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          3.39      
Median TPOT (ms):                        3.38      
P50 TPOT (ms):                           3.38      
P90 TPOT (ms):                           3.89      
P99 TPOT (ms):                           4.30      
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.87      
Median ITL (ms):                         9.92      
P50 ITL (ms):                            9.92      
P90 ITL (ms):                            10.27     
P99 ITL (ms):                            16.28     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1048.02   
Median E2EL (ms):                        1045.07   
P50 E2EL (ms):                           1045.07   
P90 E2EL (ms):                           1238.45   
P99 E2EL (ms):                           1351.02   
==================================================